{
    "flashcards": [
        {
            "term": "Strep throat",
            "definition": "A bacterial infection that causes a sore throat and is typically treated with antibiotics."
        },
        {
            "term": "Antibiotics",
            "definition": "Medications designed to terminate prokaryote cells, such as bacteria, without affecting eukaryote cells."
        },
        {
            "term": "Prokaryote cells",
            "definition": "Cells without a membrane-bound nucleus, found in bacteria."
        },
        {
            "term": "Eukaryote cells",
            "definition": "Cells with a membrane-bound nucleus, found in organisms like humans."
        },
        {
            "term": "Antibiotic resistance",
            "definition": "The ability of bacteria to survive exposure to antibiotics and continue to grow and reproduce."
        },
        {
            "term": "Natural selection",
            "definition": "The process by which organisms better adapted to their environment tend to survive and produce more offspring."
        },
        {
            "term": "Evolution",
            "definition": "The change in the inherited characteristics of biological populations over successive generations."
        },
        {
            "term": "Fitness",
            "definition": "In the biological sense, fitness is determined by an organism's ability to reproduce and pass down its genes to offspring."
        },
        {
            "term": "Allele",
            "definition": "One of two or more alternative forms of a gene that arise by mutation and are found at the same place on a chromosome."
        },
        {
            "term": "Variety",
            "definition": "Differences or diversity within a species or population."
        },
        {
            "term": "Predators",
            "definition": "Organisms that hunt, kill, and consume other organisms for food."
        },
        {
            "term": "Darker frogs",
            "definition": "Frogs with a darker coloration that camouflages them better in their habitat and makes them less visible to predators."
        },
        {
            "term": "Lighter frogs",
            "definition": "Frogs with a lighter coloration that makes them more visible to predators in their habitat."
        },
        {
            "term": "Variations and mutations",
            "definition": "Changes in the genetic material of organisms that can lead to differences in physical traits."
        },
        {
            "term": "Adaptation",
            "definition": "A characteristic or trait that enhances an organism's survival and reproductive success in its environment."
        },
        {
            "term": "Genes",
            "definition": "The units of heredity that are passed down from parents to offspring and determine the traits of an organism."
        },
        {
            "term": "Trait",
            "definition": "A specific characteristic or feature of an organism, such as its color or behavior."
        },
        {
            "term": "Habitat",
            "definition": "The natural environment in which an organism lives and obtains its food, water, and shelter."
        },
        {
            "term": "Mutations",
            "definition": "Changes in the DNA sequence that can result in new traits or variations in organisms."
        },
        {
            "term": "Positive effect",
            "definition": "A beneficial impact on an organism's survival and reproduction, leading to the increase in frequency of advantageous traits."
        },
        {
            "term": "Negative effect",
            "definition": "A detrimental impact on an organism's survival and reproduction, leading to the decrease or elimination of disadvantageous traits."
        },
        {
            "term": "Antibiotic-resistant bacteria",
            "definition": "Bacteria that have developed the ability to survive exposure to antibiotics due to genetic traits that confer resistance."
        },
        {
            "term": "Bacterial infections",
            "definition": "Infections caused by bacteria that may require treatment with antibiotics."
        },
        {
            "term": "Environment",
            "definition": "The surroundings or conditions in which an organism lives and interacts with other organisms."
        },
        {
            "term": "Crossing over",
            "definition": "The exchange of genetic material between homologous chromosomes during meiosis, leading to genetic variation."
        },
        {
            "term": "Evolutionary change",
            "definition": "Changes in the genetic makeup of populations over time, resulting in new species and adaptations."
        },
        {
            "term": "Resistant gene",
            "definition": "A gene that confers resistance to a specific antibiotic and allows bacteria to survive exposure to that antibiotic."
        },
        {
            "term": "Transfer of genes",
            "definition": "The process by which genetic material is passed from one organism to another, often occurring between bacteria."
        },
        {
            "term": "Hygiene practices",
            "definition": "Behaviors and procedures that help maintain cleanliness and prevent the spread of infection and diseases."
        },
        {
            "term": "Hospitals",
            "definition": "Institutions where patients receive medical treatment, including the diagnosis and management of diseases and injuries."
        },
        {
            "term": "Commonly used antibiotics",
            "definition": "Antibiotics that are frequently prescribed to treat bacterial infections because they are effective against a wide range of bacteria."
        },
        {
            "term": "Vaccines",
            "definition": "Preventive biological preparations that provide immunity to specific infectious diseases by stimulating the immune system to recognize and fight off pathogens."
        },
        {
            "term": "Resistance issue",
            "definition": "The problem of bacteria developing resistance to antibiotics, making it more difficult to treat bacterial infections effectively."
        },
        {
            "term": "DTaP vaccine",
            "definition": "A vaccine that protects against diphtheria, tetanus, and pertussis, three potentially deadly bacterial infections."
        },
        {
            "term": "Variability in bacteria",
            "definition": "The presence of genetic variation among bacterial populations, leading to different traits and capacities for survival."
        },
        {
            "term": "Enhanced cell wall",
            "definition": "A thicker or more complex structure that provides greater protection against antibiotics entering bacterial cells."
        },
        {
            "term": "Enzymes",
            "definition": "Proteins that catalyze chemical reactions, which in the case of bacteria, can help in breaking down antibiotics."
        },
        {
            "term": "Closed environment",
            "definition": "An environment with limited exposure to external influences and where infections can easily spread among individuals."
        },
        {
            "term": "Selective pressure",
            "definition": "The environmental factor that exerts pressure on organisms, favoring certain traits or alleles over others through natural selection."
        },
        {
            "term": "New antibiotics",
            "definition": "Medications developed to target and kill bacteria that have developed resistance to existing antibiotics."
        },
        {
            "term": "Bacterial strains",
            "definition": "Variants of bacteria that have different genetic characteristics and may exhibit varying levels of resistance to antibiotics."
        },
        {
            "term": "Fitness advantage",
            "definition": "The increased likelihood of surviving and reproducing due to specific traits that provide an advantage in a given environment."
        },
        {
            "term": "Antibiotics intake",
            "definition": "The consumption of antibiotics to treat bacterial infections, with the advice to use them only when necessary to avoid promoting antibiotic resistance."
        },
        {
            "term": "Viruses",
            "definition": "Infectious agents that can replicate only inside the living cells of organisms, requiring antiviral medications rather than antibiotics for treatment."
        },
        {
            "term": "Genetic material",
            "definition": "The DNA or RNA molecules that carry the genetic information of an organism and determine its traits."
        }
        ]
}