{
    "flashcards": [
        {
            "term": "Wormhole",
            "definition": "A theoretical passage through spacetime that could create shortcuts for long journeys across the universe."
        },
        {
            "term": "Black Hole",
            "definition": "An area in space where gravity pulls so much that even light cannot get out."
        },
        {
            "term": "Einstein's theory of relativity",
            "definition": "A theory proposing a connection between space and time as a unified entity, where the presence of matter and energy can distort spacetime."
        },
        {
            "term": "Elastic space",
            "definition": "A concept where space can be bent and warped by gravitational forces, similar to a flexible material like a waterbed."
        },
        {
            "term": "Traversable wormhole",
            "definition": "A wormhole that could be crossed allowing travel through spacetime, potentially faster than the speed of light."
        },
        {
            "term": "General relativity",
            "definition": "A mathematical theory that describes gravity as the curvature of spacetime, developed by Albert Einstein."
        },
        {
            "term": "Einstein-Rosenbridges",
            "definition": "Theoretical wormholes connecting two separate universes, where one side could resemble a black hole and the other a white hole."
        },
        {
            "term": "Cosmic strings",
            "definition": "Hypothetical one-dimensional topological defects in the fabric of spacetime proposed by particle physicists."
        },
        {
            "term": "Quantum fluctuations",
            "definition": "Tiny random changes happening in the universe at the smallest scales, influenced by the principles of quantum mechanics."
        },
        {
            "term": "Exotic matter",
            "definition": "A theoretical substance with negative mass that could be used to stabilize wormholes against gravitational collapse."
        },
        {
            "term": "Negative mass",
            "definition": "A hypothetical form of matter that would exhibit repulsive gravitational effects, pushing objects away rather than attracting them."
        },
        {
            "term": "Event horizon",
            "definition": "The point of no return around a black hole where the gravitational pull becomes so strong that nothing, not even light, can escape."
        },
        {
            "term": "White hole",
            "definition": "A theoretical region of spacetime where matter, light, and radiation emerge from, considered the opposite of a black hole."
        },
        {
            "term": "Singularity",
            "definition": "A point in spacetime where gravitational forces become infinite and space itself is infinitely curved, like the core of a black hole."
        },
        {
            "term": "Causal structure",
            "definition": "The arrangement of cause and effect relationships in spacetime, describing how events are chronologically related."
        },
        {
            "term": "Neutron star",
            "definition": "A compact star composed almost entirely of neutrons, formed from the remnants of a supernova explosion."
        },
        {
            "term": "String theory",
            "definition": "A theoretical framework in physics that suggests fundamental particles are not point-like but rather tiny strings vibrating at different frequencies."
        },
        {
            "term": "Exotic matter",
            "definition": "A theoretical substance with negative mass that could be used to stabilize wormholes against gravitational collapse."
        },
        {
            "term": "Vacuum of space",
            "definition": "The state of space where particles and antiparticles constantly fluctuate in and out of existence due to quantum fluctuations."
        },
        {
            "term": "Quantum mechanics",
            "definition": "The field of physics that describes the behavior of subatomic particles, based on principles of superposition, entanglement, and quantized energy levels."
        },
        {
            "term": "Wormhole hub",
            "definition": "A central location where multiple wormholes converge, potentially allowing for rapid interstellar travel between different points in the cosmos."
        },
        {
            "term": "Time travel paradoxes",
            "definition": "Problems or contradictions that arise when attempting to change events in the past or future, leading to inconsistencies in the timeline."
        },
        {
            "term": "Particle physicists",
            "definition": "Scientists who study the properties and interactions of particles at the subatomic level, often focusing on high-energy particle accelerators."
        },
        {
            "term": "Neutrino",
            "definition": "A type of subatomic particle with extremely low mass and no electric charge, interacting only weakly with other matter."
        },
        {
            "term": "Spacetime",
            "definition": "The combined concept of three-dimensional space and one-dimensional time as a single continuum, affected by gravity and motion."
        },
        {
            "term": "Tachyon",
            "definition": "A hypothetical particle that travels faster than the speed of light, associated with unstable motion and potential violations of causality."
        },
        {
            "term": "Astrophysicists",
            "definition": "Scientists who study the physical properties and behavior of celestial objects and phenomena in the universe."
        },
        {
            "term": "Dark matter",
            "definition": "An unseen form of matter that does not emit, absorb, or reflect light, inferred to exist based on gravitational effects on visible matter."
        },
        {
            "term": "Antimatter",
            "definition": "Particles that have the same mass as their corresponding matter particles but with opposite electric charge, leading to annihilation upon contact."
        }
    ]
}